org/lects/15/plan.org
* 講義終了後のお知らせ


** <2016-02-18 木> 3回目の未提出扱いのレポートについて

h26j071, h26j027, h26j088, h26j106, h26j128 の hand_dev.org 未提出

- h26j071
  - ファイルは存在するが，中身は0

- h26j072
  - hand-dev.org だった。評価しました。

- h26j088
  - hand_dec.org だった。評価しました。

- h26j106
  - hamd_dev.org だった。評価しました。

- h26j128
  - hand-dev.org だった。評価しました。



** <2016-02-18 木> 1,2,3 回目のレポートの再提出について

1回目の再提出者

: @login_1_5 = [
:   'h26j006', 'h26j033', 'h26j039', 'h26j068'
: ]


2回目の再提出者
: @login_2_3 = [
:    'h26j006', 'h26j087', 'h26j093', 'h26j121'
: ]

3回目の再提出者
: @login_3_2 = [
:   'h26j006', 'h26j025', 'h26j033', 'h26j039', 'h26j041',
:   'h26j061', 'h26j064', 'h26j068', 'h26j071', 'h26j072',
:   'h26j076', 'h26j084', 'h26j087', 'h26j092', 'h26j093',
:   'h26j100', 'h26j103', 'h26j119', 'h26j121', 'h26j126'
: ]


  
* お知らせ

** 状況確認

   講義時間中に，一人づつ，出席状況，開発状況，レポート成績を確認しま
   す。

** 最終レポートのお知らせ (2/9から変更あり)

   2/19 〆切 

   提出するもの
   - ~/progs/game で以下のことができること
     - (cd ~/progs/game; make clean) 
       - card, deck, hand, lib, include の中を clean する
     - (cd ~/progs/game; make build) 
       - 必要なヘッダファイル，ライブラリをインストールし，
       - poker/poker をつくる
     この3種類の make の結果を ~/progs/game/Make.out という名前のファ
     イルに保存しておいてください。やり方は下記です:

     #+BEGIN_SRC sh
script Make.out # Make.outへの記録開始

cd ~/progs/game
make clean ; make build
poker/poker  # ゲームの実行
# ゲームをおこなう
# ゲームを終わる

exit      
     #+END_SRC

     以上で，script ~ exit までの入出力が，Make.out に記録されています。
     二度やるときは，Make.out を一旦消してから，再度やってください。
     
   - poker モジュールの開発についてのレポート
     - card,deck,handの開発と何が違がうか
  
     ~/progs/reports/4/poker_dev.org
     
   - 講義のまとめ
     - 何を学び，行ない，何を得たか
     - 意見・感想

     ~/progs/reports/4/progs.org
   
** hand_dev.org，card・deck・hand モジュールを集めました。

確認用ファイル   
- ~suzuki/progs/collected_srcs/3/自分のログイン名/ 
- ~suzuki/progs/collected_reports/3/自分のログイン名/hand_dev.org
- ~suzuki/progs/reports/3/report-3.org

評価は， ~suzuki/progs/reports/3/reports-3.org を Emacs で見てください。

*** 内容


   - hand モジュールのテスト駆動開発についてまとめてください。

   - 意見・感想を添えて下さい。

   - ~/progs/reports/3/hand_dev.org に提出してください。

   - 締め切りは，2/8 とします。

** 着席端末について

   端末室では，先週と同じ席に座わって下さい。
   先々週集めた，進行状況の確認のためです。
   先週・先々週欠席した人は申し出てください。

** 第1回目レポートについて 再回収者の評価をしました。

~suzuki/progs/reports/1/reports-1-4.org を Emacs で見てください。

** 第2回目レポート 再回収者の評価をしました。

下記の人，再回収し，評価しました。
   
#+BEGIN_SRC ruby
@logins = ["h26j031"，"h26j041", "h26j083", "h26j090", "h26j093", "h26j110"]
#+END_SRC

~suzuki/progs/reports/2/reports-2-2.org を見てください。

**** 課題

    - ~/progs/game

    - deckモジュールの機能について，各機能のインタフェースを決め，決めた理由・
      過程を, 箇条書きで，まとめてください。

    - 講義への意見・要望・感想，その他講義に関することなんでも。

**** 提出物と場所
    
    - ~/progs/game
    - ~/progs/reports/2/deck_spec.org 

**** 提出期限




    - 01/12 (火) 15:00
      
** 第3回目レポート 再提出希望者

#+BEGIN_SRC ruby
@login = [
  'h26j068'， 'h26j077', 'h26j080', 'h26j088', 'h26j092', 
  'h26j093'
]
#+END_SRC

** 第2回目レポート 再提出希望者

#+BEGIN_SRC ruby
@login = [
  'h26j121'
]
#+END_SRC

* 今後の進行について [8/9]

- [X] 07 <2015-12-08 火> card_display_sort
- [X] 08 <2015-12-15 火> card_to_stringの解説，poker_game.start deck
- [X] 09 <2015-12-22 火> deck, cardモジュールの利用
- [X] 10 <2016-01-12 火> deck，
- [X] 11 <2016-01-19 火> hand モジュールの機能と設計，game/doc/hand-dev.org の作成
- [X] 12 <2016-01-26 火> hand 機能のテスト駆動開発，game/doc/hand-dev.org の作成
- [X] 13 <2016-02-02 火> hand 機能のテスト駆動開発，
  game/doc/hand-dev.org の作成，poker モジュールも考え始める
- [X] 14 <2016-02-09 火> poker
- [ ] 15 <2016-02-16 火> poker

  card, deck, hand, poker を完成させてください。

* 今日の講義について

poker モジュールの開発をおこなってください。

その後の開発については，各自にお任せします。レスポンスカードの提出で出
席にします。講義終了時間前でも，退出してかまいません。

来週の補講までに，できるだけ自分で開発を進めてください。

* Todo ポーカーゲームの開発 
  SCHEDULED: <2015-12-15 火> 

** Done Hand モジュールの開発 
   CLOSED: [2016-02-16 火 09:43] SCHEDULED: <2016-01-19 火>

   開発 [/]
   - [X] モジュールの機能 
   - [X] 機能のテスト駆動開発 [5/5]
     - [X] 手札と生成
     - [X] カードの出し入れ
     - [X] ソート
     - [X] 文字列化
     - [X] 役と判定

   game/doc/hand-dev.org の作成も併せて行なってください。

** Todo Poker (モジュール)の開発 
   SCHEDULED: <2016-01-26 火>

   game/poker/ を作りましょう。

* Doing 既習の内容を思いだす
  SCHEDULED: <2015-10-06 火>

** 2015.11.09 
*** C言語
**** 構造体 
**** 型定義 typedef 
**** 列挙型 enum

*** make
    
