org/lects/15/plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>plan</title>
<!-- 2016-02-16 火 10:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="m" />
</head>
<body>
<div id="content">
<h1 class="title">plan</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. お知らせ</a>
<ul>
<li><a href="#sec-1-1">1.1. 状況確認</a></li>
<li><a href="#sec-1-2">1.2. 最終レポートのお知らせ (2/9から変更あり)</a></li>
<li><a href="#sec-1-3">1.3. hand<sub>dev</sub>.org，card・deck・hand モジュールを集めました。</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. 内容</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. 着席端末について</a></li>
<li><a href="#sec-1-5">1.5. 第1回目レポートについて 再回収者の評価をしました。</a></li>
<li><a href="#sec-1-6">1.6. 第2回目レポート 再回収者の評価をしました。</a></li>
<li><a href="#sec-1-7">1.7. 第3回目レポート 再提出希望者</a></li>
<li><a href="#sec-1-8">1.8. 第2回目レポート 再提出希望者</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 今後の進行について <code>[8/9]</code></a></li>
<li><a href="#sec-3">3. 今日の講義について</a></li>
<li><a href="#sec-4">4. Todo ポーカーゲームの開発</a>
<ul>
<li><a href="#sec-4-1">4.1. Done Hand モジュールの開発</a></li>
<li><a href="#sec-4-2">4.2. Todo Poker (モジュール)の開発</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Doing 既習の内容を思いだす</a>
<ul>
<li><a href="#sec-5-1">5.1. 2015.11.09</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. C言語</a></li>
<li><a href="#sec-5-1-2">5.1.2. make</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. プログラム関連演習@cis ((cis-org s-org))</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 終わった内容</a>
<ul>
<li><a href="#sec-6-1">6.1. Done はじめに</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. 提案 <code>[2/2]</code></a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2. Done 前回の講義のまとめ</a></li>
<li><a href="#sec-6-3">6.3. Done 講義紹介続き</a></li>
<li><a href="#sec-6-4">6.4. Done ~/progs/ のはじまりの確認</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1. ~/progs 講義用のディレクトリの確認</a></li>
<li><a href="#sec-6-4-2">6.4.2. ~/progs/README.org の確認</a></li>
</ul>
</li>
<li><a href="#sec-6-5">6.5. Done テスト体験</a></li>
<li><a href="#sec-6-6">6.6. Done テストと関数と開発について理解する</a></li>
<li><a href="#sec-6-7">6.7. Done トランプカードの表示問題 simple のテストによる開発</a>
<ul>
<li><a href="#sec-6-7-1">6.7.1. カード表示問題<sub>simpleのテストによる開発</sub> ((@cis.org @s.org)) <code>[5/5]</code></a></li>
</ul>
</li>
<li><a href="#sec-6-8">6.8. Done one トランプカードの表示問題 simple のテストによる開発</a></li>
<li><a href="#sec-6-9">6.9. Done トランプカードの表示問題 sort のテストによる開発</a></li>
<li><a href="#sec-6-10">6.10. Done カード表示問題<sub>simpleのテストによる開発</sub> ((@cis.org @s.org)) <code>[5/5]</code></a></li>
<li><a href="#sec-6-11">6.11. gameプロジェクトの開発</a>
<ul>
<li><a href="#sec-6-11-1">6.11.1. 先週の Makefile の説明</a></li>
<li><a href="#sec-6-11-2">6.11.2. 今週のMakefileの説明</a></li>
</ul>
</li>
<li><a href="#sec-6-12">6.12. deckモジュールの機能の開発 <code>[6/6]</code></a></li>
</ul>
</li>
<li><a href="#sec-7">7. Todo self checks <code>[6/11]</code></a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> お知らせ</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 状況確認</h3>
<div class="outline-text-3" id="text-1-1">
<p>
講義時間中に，一人づつ，出席状況，開発状況，レポート成績を確認しま
す。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 最終レポートのお知らせ (2/9から変更あり)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
2/19 〆切 
</p>

<p>
提出するもの
</p>
<ul class="org-ul">
<li>~/progs/game で以下のことができること
<ul class="org-ul">
<li>(cd ~/progs/game; make clean) 
<ul class="org-ul">
<li>card, deck, hand, lib, include の中を clean する
</li>
</ul>
</li>
<li>(cd ~/progs/game; make build) 
<ul class="org-ul">
<li>必要なヘッダファイル，ライブラリをインストールし，
</li>
<li>poker/poker をつくる
</li>
</ul>
</li>
</ul>
<p>
この3種類の make の結果を ~/progs/game/Make.out という名前のファ
イルに保存しておいてください。やり方は下記です:
</p>

<div class="org-src-container">

<pre class="src src-sh">script Make.out # Make.outへの記録開始

cd ~/progs/game
make clean ; make build
poker/poker  # ゲームの実行
# ゲームをおこなう
# ゲームを終わる

exit
</pre>
</div>

<p>
以上で，script ~ exit までの入出力が，Make.out に記録されています。
二度やるときは，Make.out を一旦消してから，再度やってください。
</p>
</li>

<li>poker モジュールの開発についてのレポート
<ul class="org-ul">
<li>card,deck,handの開発と何が違がうか
</li>
</ul>
<p>
~/progs/reports/4/poker<sub>dev</sub>.org
</p>
</li>

<li>講義のまとめ
<ul class="org-ul">
<li>何を学び，行ない，何を得たか
</li>
<li>意見・感想
</li>
</ul>
<p>
~/progs/reports/4/progs.org
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> hand<sub>dev</sub>.org，card・deck・hand モジュールを集めました。</h3>
<div class="outline-text-3" id="text-1-3">
<p>
確認用ファイル   
</p>
<ul class="org-ul">
<li>~suzuki/progs/collected<sub>srcs</sub>/3/自分のログイン名/ 
</li>
<li>~suzuki/progs/collected<sub>reports</sub>/3/自分のログイン名/hand<sub>dev</sub>.org
</li>
<li>~suzuki/progs/reports/3/report-3.org
</li>
</ul>

<p>
評価は， ~suzuki/progs/reports/3/reports-3.org を Emacs で見てください。
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 内容</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>hand モジュールのテスト駆動開発についてまとめてください。
</li>

<li>意見・感想を添えて下さい。
</li>

<li>~/progs/reports/3/hand<sub>dev</sub>.org に提出してください。
</li>

<li>締め切りは，2/8 とします。
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 着席端末について</h3>
<div class="outline-text-3" id="text-1-4">
<p>
端末室では，先週と同じ席に座わって下さい。
先々週集めた，進行状況の確認のためです。
先週・先々週欠席した人は申し出てください。
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 第1回目レポートについて 再回収者の評価をしました。</h3>
<div class="outline-text-3" id="text-1-5">
<p>
~suzuki/progs/reports/1/reports-1-4.org を Emacs で見てください。
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 第2回目レポート 再回収者の評価をしました。</h3>
<div class="outline-text-3" id="text-1-6">
<p>
下記の人，再回収し，評価しました。
</p>

<div class="org-src-container">

<pre class="src src-ruby">@logins = ["h26j031"，"h26j041", "h26j083", "h26j090", "h26j093", "h26j110"]
</pre>
</div>

<p>
~suzuki/progs/reports/2/reports-2-2.org を見てください。
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-6-0-1" name="sec-1-6-0-1"></a>課題<br  /><div class="outline-text-5" id="text-1-6-0-1">
<ul class="org-ul">
<li>~/progs/game
</li>

<li>deckモジュールの機能について，各機能のインタフェースを決め，決めた理由・
過程を, 箇条書きで，まとめてください。
</li>

<li>講義への意見・要望・感想，その他講義に関することなんでも。
</li>
</ul>
</div>
</li>

<li><a id="sec-1-6-0-2" name="sec-1-6-0-2"></a>提出物と場所<br  /><div class="outline-text-5" id="text-1-6-0-2">
<ul class="org-ul">
<li>~/progs/game
</li>
<li>~/progs/reports/2/deck<sub>spec</sub>.org 
</li>
</ul>
</div>
</li>

<li><a id="sec-1-6-0-3" name="sec-1-6-0-3"></a>提出期限<br  /><div class="outline-text-5" id="text-1-6-0-3">
<ul class="org-ul">
<li>01/12 (火) 15:00
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 第3回目レポート 再提出希望者</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-ruby">@login = [
  'h26j068'， 'h26j077', 'h26j080', 'h26j088', 'h26j092', 
  'h26j093'
]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 第2回目レポート 再提出希望者</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-ruby">@login = [
  'h26j121'
]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 今後の進行について <code>[8/9]</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>[X]</code> 07 <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-12-08 火&gt;</span></span> card<sub>display</sub><sub>sort</sub>
</li>
<li><code>[X]</code> 08 <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-12-15 火&gt;</span></span> card<sub>to</sub><sub>stringの解説，poker</sub><sub>game</sub>.start deck
</li>
<li><code>[X]</code> 09 <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-12-22 火&gt;</span></span> deck, cardモジュールの利用
</li>
<li><code>[X]</code> 10 <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-01-12 火&gt;</span></span> deck，
</li>
<li><code>[X]</code> 11 <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-01-19 火&gt;</span></span> hand モジュールの機能と設計，game/doc/hand-dev.org の作成
</li>
<li><code>[X]</code> 12 <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-01-26 火&gt;</span></span> hand 機能のテスト駆動開発，game/doc/hand-dev.org の作成
</li>
<li><code>[X]</code> 13 <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-02-02 火&gt;</span></span> hand 機能のテスト駆動開発，
game/doc/hand-dev.org の作成，poker モジュールも考え始める
</li>
<li><code>[X]</code> 14 <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-02-09 火&gt;</span></span> poker
</li>
<li><code>[&#xa0;]</code> 15 <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-02-16 火&gt;</span></span> poker

<p>
card, deck, hand, poker を完成させてください。
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 今日の講義について</h2>
<div class="outline-text-2" id="text-3">
<p>
poker モジュールの開発をおこなってください。
</p>

<p>
その後の開発については，各自にお任せします。レスポンスカードの提出で出
席にします。講義終了時間前でも，退出してかまいません。
</p>

<p>
来週の補講までに，できるだけ自分で開発を進めてください。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Todo ポーカーゲームの開発</h2>
<div class="outline-text-2" id="text-4">
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Done Hand モジュールの開発</h3>
<div class="outline-text-3" id="text-4-1">
<p>
開発 <code>[/]</code>
</p>
<ul class="org-ul">
<li><code>[X]</code> モジュールの機能 
</li>
<li><code>[X]</code> 機能のテスト駆動開発 <code>[5/5]</code>
<ul class="org-ul">
<li><code>[X]</code> 手札と生成
</li>
<li><code>[X]</code> カードの出し入れ
</li>
<li><code>[X]</code> ソート
</li>
<li><code>[X]</code> 文字列化
</li>
<li><code>[X]</code> 役と判定
</li>
</ul>
</li>
</ul>

<p>
game/doc/hand-dev.org の作成も併せて行なってください。
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Todo Poker (モジュール)の開発</h3>
<div class="outline-text-3" id="text-4-2">
<p>
game/poker/ を作りましょう。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Doing 既習の内容を思いだす</h2>
<div class="outline-text-2" id="text-5">
</div>
