org/lects/15/plan.org
**** Makefile のルールの書き方

**** コンパイルの過程


** [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/cis-programming-lects/][プログラム関連演習@cis]] (([[file+emacs:~suzuki/lects/prog/org-docs/cis-programming-lects/][cis-org]] [[file+emacs:~/COMM/Lects/prog/site/org-docs/cis-programming-lects][s-org]])) 
   下記のことが重要です:

   - [-] 重要なプログラムの構成要素 [3/4]

     - [X] 構造体，型定義

       => [[抽象化]]と[[情報隠蔽]] のために使います。

     - [X] 関数

       => [[抽象化]]と[[情報隠蔽]] のために使います。

     - [X] ヘッダファイルの役割

       => インタフェースの提供と遵守のために使います。

     - [ ] 名前と実体の管理

       => 情報公開と隠蔽のために使います。

   - [X] コンパイル過程のこと [7/7]
     - [X] include
     - [X] gcc
     - [X] .o ([[オブジェクト・ファイル]])

       => 関数や変数，定数の入れ物です。

     - [X] .a ([[静的ライブラリ]]), .so([[動的ライブラリ]])

       => 関数や変数，定数の入れ物です。

     - [X] ld ([[ローダ]]，[[リンケージ・エディタ]])

       => オブジェクトファイルやライブラリを集めて，実行プログラムを作
       成するコマンドです。

     - [X] a.out (実行プログラム)

     - [X] make


* 終わった内容
** Done はじめに 
   CLOSED: [2015-10-13 Tue 18:39]

   - サイトの構成と内容を大きく変更しました。まだ書き換え中のものもあり
     ます。おかしなところや改善点を教えて下さい。

*** 提案 [2/2]

   - [X] 各列最後尾に，TAさんの席を作りたいと思います。協力お願いします。
   - [X] 各自の ~/progs/lects/の下，02.orgとかに講義のメモを作成しませ
     んか？ 

** Done 前回の講義のまとめ
   CLOSED: [2015-10-13 Tue 18:40]
   - [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/lects/01/index.html][講義.01のまとめ]] (([[file+emacs:~suzuki/lects/prog/site/lects/01/index.org][@cis.org]] [[file+emacs:~/COMM/Lects/prog/site/lects/01/index.org][@s.org]]))

** Done 講義紹介続き
   CLOSED: [2015-10-13 Tue 18:40]

   サイトをリニューアルしたので，もう一度説明:
   - 講義サイト renewal
     [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/][ソフトウェア構成論]] (([[~suzuki/lects/prog/site/index.org][cis-org]] [[~/COMM/Lects/prog/site/index.org][s-org]])) 

** Done ~/progs/ のはじまりの確認
   CLOSED: [2015-10-13 Tue 18:40]

*** ~/progs 講義用のディレクトリの確認

#+BEGIN_SRC sh :results output example :exports results
# ~/progsの表示スクリプトの実行
~/COMM/bin/lstree ~/progs
#+END_SRC

こんなふうにディレクトリを作ります:
#+begin_example 
~/progs
+-README.org
+-card_display
+-cutter
+-game-+-card
|      +-deck
|      +-hand
|      +-poker
+-lects
#+end_example

*** ~/progs/README.org の確認

    README.org ([[emacs org-mode][補足]]) に，ディレクトリの説明を書きます。


#+BEGIN_SRC org :tangle ~/progs/lects/Org.org
,** マークアップ文書の書き方を覚えましょう。(1)
- 見出し (行頭に * を書く)
- 箇条書き (行頭に * を書く)
#+END_SRC

# #+include: ~/progs/lects/Org.org

~/progs/README.org を次の様な内容で書きます:
#+BEGIN_SRC org :tangle ~/progs/README.org
,#+title: ~/progs/README.org
,* ~/progs ソフトウェア構成論開発用ディレクトリ
,** ディレクトリの構成と使用目的:
- ./lects: 毎回の講義のめもを置きましょう
- ./card_display: カード表示問題の開発用
- ./cutter: テスト用
- ./game: ポーカーゲーム開発用
  - ./game/card: カードモジュール
  - ./game/deck: 山モジュール
  - ./game/hand: 手札モジュール
  - ./game/poker: ポーカーモジュール
#+END_SRC


** Done テスト体験
   CLOSED: [2015-10-29 木 03:11] SCHEDULED: <2015-10-06 火>

    [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/cutter][cutterの使い方]] (([[file+emacs:~suzuki/lects/prog/site/org-docs/cutter][@cis.org]] [[fle+emacs:~/COMM/Lects/prog/site/org-docs/cutter][@s.org]]))

    前回の資料には，説明不足がありました。すみません。不足していたのは，
    作業ディレクトリの指定，ファイル名，シェルコマンドを実行すること，
    などです。中身を理解し，類推・対応できるようになってほしいです。

**** 前回
     - テストする機能は，C言語文字列ライブラリの ~strcmp~ です。
     - テストを書いてみました。
     - テストをビルドするためのMakefileを作成しました。
     - cutter を使ってみました。
       
**** Done 今回もう一度
     CLOSED: [2015-10-29 木 03:11]

     流れは理解したと思うので，今度は意味を考えながら，もう一度同じこと
     をやりましょう。

     要望があったので，今回は suzuki が実際に作りながら説明します。

     テストとは何であるか，何がいいか，考えてみてください。
     
** Done テストと関数と開発について理解する
   CLOSED: [2015-10-29 木 03:36] SCHEDULED: <2015-10-27 火>
  
    [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/what-is-tdd/][テストによる開発とは]]
    (([[file+emacs:~suzuki/lects/prog/site/org-docs/what-is-tdd/][@cis.org]]
    [[file+emacs:~/COMM/Lects/prog/site/org-docs/what-is-tdd/][@s.org]]))

    本日，一通り説明しました。

    [[関数の意味]]の補足説明を書きましたが，説明できませんでした。またいつ
    か。

** Done トランプカードの表示問題 simple のテストによる開発
   CLOSED: [2015-12-05 土 16:27] SCHEDULED: <2015-10-27 火>

   [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/card-display/][カード表示問題の始まり]] (([[file+emacs:~suzuki/lects/prog/org-docs/card-display/][@cis.org]] [[file+emacs:~/COMM/Lects/prog/site/org-docs/card-display/][@s.org]]))

   - 概要は説明しました。<2015-10-27 火>
   - 設計について説明しています。<2015-11-10 火>~
   - カード表示問題の開発をあわせて行いながら，理解しましょう。<2015-11-10 火>~

*** [[http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/tdd-card-display-simple/][カード表示問題_simpleのテストによる開発]] (([[file+emacs:~suzuki/lects/prog/org-docs/tdd-card-display-simple/][@cis.org]] [[file+emacs:~/COMM/Lects/prog/site/org-docs/tdd-card-display-simple/][@s.org]])) [5/5]
    - [X] テストによる開発を始めました。<2015-11-10 火>
    - [X] 機能 card_suit_new_from_string のテストが通りました。<2015-11-10 火>
    - [X] 機能 card_no_new_from_string のテストを通したいです。<2015-11-17 火>
    - [X] 機能 card_new のテストを通しましょう。<2015-12-01 火>
    - [X] 機能 card_to_string のテストは，各自で設計・実装・
          テストのサイクルを考えながらおこなってください。

      常に，機能の利用，テスト，要求，実装，提供を意識してください。そ
      のために，どのディレクトリのどのファイルを修正するのか，考えなが
      ら行ってください。

** Done one トランプカードの表示問題 simple のテストによる開発
  CLOSED: [2015-12-21 月 16:21] SCHEDULED: <2015-10-27 火>

  - card_to_string のテストによる開発について，解説します。

** Done トランプカードの表示問題 sort のテストによる開発
  CLOSED: [2015-12-21 月 16:21] SCHEDULED: <2015-12-08 火>

  - cards_sort のテストが，クラッシュした原因について説明します。

    
