org/lects/15/plan.html

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 2015.11.09</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> C言語</h4>
<div class="outline-text-4" id="text-5-1-1">
</div><ol class="org-ol"><li><a id="sec-5-1-1-1" name="sec-5-1-1-1"></a>構造体<br  /></li>
<li><a id="sec-5-1-1-2" name="sec-5-1-1-2"></a>型定義 typedef<br  /></li>
<li><a id="sec-5-1-1-3" name="sec-5-1-1-3"></a>列挙型 enum<br  /></li></ol>
</div>

<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> make</h4>
<div class="outline-text-4" id="text-5-1-2">
</div><ol class="org-ol"><li><a id="sec-5-1-2-1" name="sec-5-1-2-1"></a>Makefile のルールの書き方<br  /></li>

<li><a id="sec-5-1-2-2" name="sec-5-1-2-2"></a>コンパイルの過程<br  /></li></ol>
</div>
</div>


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/cis-programming-lects/">プログラム関連演習@cis</a> ((<a href="file:///users/home/masayuki/lects/prog/org-docs/cis-programming-lects/">cis-org</a> <a href="file:///users/home/masayuki/COMM/Lects/prog/site/org-docs/cis-programming-lects">s-org</a>))</h3>
<div class="outline-text-3" id="text-5-2">
<p>
下記のことが重要です:
</p>

<ul class="org-ul">
<li><code>[-]</code> 重要なプログラムの構成要素 <code>[3/4]</code>

<ul class="org-ul">
<li><code>[X]</code> 構造体，型定義

<p>
=&gt; <i>抽象化</i>と<i>情報隠蔽</i> のために使います。
</p>
</li>

<li><code>[X]</code> 関数

<p>
=&gt; <i>抽象化</i>と<i>情報隠蔽</i> のために使います。
</p>
</li>

<li><code>[X]</code> ヘッダファイルの役割

<p>
=&gt; インタフェースの提供と遵守のために使います。
</p>
</li>

<li><code>[&#xa0;]</code> 名前と実体の管理

<p>
=&gt; 情報公開と隠蔽のために使います。
</p>
</li>
</ul>
</li>

<li><code>[X]</code> コンパイル過程のこと <code>[7/7]</code>
<ul class="org-ul">
<li><code>[X]</code> include
</li>
<li><code>[X]</code> gcc
</li>
<li><code>[X]</code> .o (<i>オブジェクト・ファイル</i>)

<p>
=&gt; 関数や変数，定数の入れ物です。
</p>
</li>

<li><code>[X]</code> .a (<i>静的ライブラリ</i>), .so(<i>動的ライブラリ</i>)

<p>
=&gt; 関数や変数，定数の入れ物です。
</p>
</li>

<li><code>[X]</code> ld (<i>ローダ</i>，<i>リンケージ・エディタ</i>)

<p>
=&gt; オブジェクトファイルやライブラリを集めて，実行プログラムを作
成するコマンドです。
</p>
</li>

<li><code>[X]</code> a.out (実行プログラム)
</li>

<li><code>[X]</code> make
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 終わった内容</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Done はじめに</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>サイトの構成と内容を大きく変更しました。まだ書き換え中のものもあり
ます。おかしなところや改善点を教えて下さい。
</li>
</ul>
</div>

<div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> 提案 <code>[2/2]</code></h4>
<div class="outline-text-4" id="text-6-1-1">
<ul class="org-ul">
<li><code>[X]</code> 各列最後尾に，TAさんの席を作りたいと思います。協力お願いします。
</li>
<li><code>[X]</code> 各自の ~/progs/lects/の下，02.orgとかに講義のメモを作成しませ
んか？ 
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Done 前回の講義のまとめ</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/lects/01/index.html">講義.01のまとめ</a> ((<a href="file:///users/home/masayuki/lects/prog/site/lects/01/index.html">@cis.org</a> <a href="file:///users/home/masayuki/COMM/Lects/prog/site/lects/01/index.html">@s.org</a>))
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Done 講義紹介続き</h3>
<div class="outline-text-3" id="text-6-3">
<p>
サイトをリニューアルしたので，もう一度説明:
</p>
<ul class="org-ul">
<li>講義サイト renewal
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/">ソフトウェア構成論</a> ((<a href="file:///users/home/masayuki/lects/prog/site/index.html">cis-org</a> <a href="file:///users/home/masayuki/COMM/Lects/prog/site/index.html">s-org</a>)) 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Done ~/progs/ のはじまりの確認</h3>
<div class="outline-text-3" id="text-6-4">
</div>

<div id="outline-container-sec-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> ~/progs 講義用のディレクトリの確認</h4>
<div class="outline-text-4" id="text-6-4-1">
<p>
こんなふうにディレクトリを作ります:
</p>
<pre class="example">
~/progs
+-README.org
+-card_display
+-cutter
+-game-+-card
|      +-deck
|      +-hand
|      +-poker
+-lects
</pre>
</div>
</div>

<div id="outline-container-sec-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> ~/progs/README.org の確認</h4>
<div class="outline-text-4" id="text-6-4-2">
<p>
README.org (<i>補足</i>) に，ディレクトリの説明を書きます。
</p>


<div class="org-src-container">

<pre class="src src-org">** マークアップ文書の書き方を覚えましょう。(1)
- 見出し (行頭に * を書く)
- 箇条書き (行頭に * を書く)
</pre>
</div>

<p>
~/progs/README.org を次の様な内容で書きます:
</p>
<div class="org-src-container">

<pre class="src src-org">#+title: ~/progs/README.org
* ~/progs ソフトウェア構成論開発用ディレクトリ
** ディレクトリの構成と使用目的:
- ./lects: 毎回の講義のめもを置きましょう
- ./card_display: カード表示問題の開発用
- ./cutter: テスト用
- ./game: ポーカーゲーム開発用
  - ./game/card: カードモジュール
  - ./game/deck: 山モジュール
  - ./game/hand: 手札モジュール
  - ./game/poker: ポーカーモジュール
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Done テスト体験</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/cutter">cutterの使い方</a> ((<a href="file:///users/home/masayuki/lects/prog/site/org-docs/cutter">@cis.org</a> <i>@s.org</i>))
</p>

<p>
前回の資料には，説明不足がありました。すみません。不足していたのは，
作業ディレクトリの指定，ファイル名，シェルコマンドを実行すること，
などです。中身を理解し，類推・対応できるようになってほしいです。
</p>
</div>

<ol class="org-ol"><li><a id="sec-6-5-0-1" name="sec-6-5-0-1"></a>前回<br  /><div class="outline-text-5" id="text-6-5-0-1">
<ul class="org-ul">
<li>テストする機能は，C言語文字列ライブラリの <code>strcmp</code> です。
</li>
<li>テストを書いてみました。
</li>
<li>テストをビルドするためのMakefileを作成しました。
</li>
<li>cutter を使ってみました。
</li>
</ul>
</div>
</li>

<li><a id="sec-6-5-0-2" name="sec-6-5-0-2"></a>Done 今回もう一度<br  /><div class="outline-text-5" id="text-6-5-0-2">
<p>
流れは理解したと思うので，今度は意味を考えながら，もう一度同じこと
をやりましょう。
</p>

<p>
要望があったので，今回は suzuki が実際に作りながら説明します。
</p>

<p>
テストとは何であるか，何がいいか，考えてみてください。
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Done テストと関数と開発について理解する</h3>
<div class="outline-text-3" id="text-6-6">
<p>
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/what-is-tdd/">テストによる開発とは</a>
((<a href="file:///users/home/masayuki/lects/prog/site/org-docs/what-is-tdd/">@cis.org</a>
<a href="file:///users/home/masayuki/COMM/Lects/prog/site/org-docs/what-is-tdd/">@s.org</a>))
</p>

<p>
本日，一通り説明しました。
</p>

<p>
<i>関数の意味</i>の補足説明を書きましたが，説明できませんでした。またいつ
か。
</p>
</div>
</div>

<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> Done トランプカードの表示問題 simple のテストによる開発</h3>
<div class="outline-text-3" id="text-6-7">
<p>
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/card-display/">カード表示問題の始まり</a> ((<a href="file:///users/home/masayuki/lects/prog/org-docs/card-display/">@cis.org</a> <a href="file:///users/home/masayuki/COMM/Lects/prog/site/org-docs/card-display/">@s.org</a>))
</p>

<ul class="org-ul">
<li>概要は説明しました。<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-10-27 火&gt;</span></span>
</li>
<li>設計について説明しています。<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-10 火&gt;</span></span>~
</li>
<li>カード表示問題の開発をあわせて行いながら，理解しましょう。<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-10 火&gt;</span></span>~
</li>
</ul>
</div>

<div id="outline-container-sec-6-7-1" class="outline-4">
<h4 id="sec-6-7-1"><span class="section-number-4">6.7.1</span> <a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/tdd-card-display-simple/">カード表示問題<sub>simpleのテストによる開発</sub></a> ((<a href="file:///users/home/masayuki/lects/prog/org-docs/tdd-card-display-simple/">@cis.org</a> <a href="file:///users/home/masayuki/COMM/Lects/prog/site/org-docs/tdd-card-display-simple/">@s.org</a>)) <code>[5/5]</code></h4>
<div class="outline-text-4" id="text-6-7-1">
<ul class="org-ul">
<li><code>[X]</code> テストによる開発を始めました。<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-10 火&gt;</span></span>
</li>
<li><code>[X]</code> 機能 card<sub>suit</sub><sub>new</sub><sub>from</sub><sub>string</sub> のテストが通りました。<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-10 火&gt;</span></span>
</li>
<li><code>[X]</code> 機能 card<sub>no</sub><sub>new</sub><sub>from</sub><sub>string</sub> のテストを通したいです。<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-17 火&gt;</span></span>
</li>
<li><code>[X]</code> 機能 card<sub>new</sub> のテストを通しましょう。<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-12-01 火&gt;</span></span>
</li>
<li><code>[X]</code> 機能 card<sub>to</sub><sub>string</sub> のテストは，各自で設計・実装・
テストのサイクルを考えながらおこなってください。

<p>
常に，機能の利用，テスト，要求，実装，提供を意識してください。そ
のために，どのディレクトリのどのファイルを修正するのか，考えなが
ら行ってください。
</p>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> Done one トランプカードの表示問題 simple のテストによる開発</h3>
<div class="outline-text-3" id="text-6-8">
<ul class="org-ul">
<li>card<sub>to</sub><sub>string</sub> のテストによる開発について，解説します。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> Done トランプカードの表示問題 sort のテストによる開発</h3>
<div class="outline-text-3" id="text-6-9">
<ul class="org-ul">
<li>cards<sub>sort</sub> のテストが，クラッシュした原因について説明します。
</li>
</ul>
</div>
</div>
